# ShapeType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTrayType..::..ShapeType Property
CableTrayType Class See Also
---
Shape of this cable tray type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CableTrayShape ShapeType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ShapeType As CableTrayShape
	Get
```

Visual C++
---
```text
public:
property CableTrayShape ShapeType {
	CableTrayShape get ();
}
```

# See Also
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace